In [7]:
#1. Create a DataFrame named financial_data that contains quarterly financial metrics for the years 2021 and 2022. The metrics include "Sales" and "Expenses," which are further divided into "Online" and "In-Store" channels. 
import pandas as pd

index = pd.MultiIndex.from_product([[2021, 2022], ['Q1', 'Q2', 'Q3', 'Q4']], names=['Year', 'Quarter'])
data = {
    ('Sales', 'Online'): [1000, 1200, 1100, 1300, 1400, 1500, 1600, 1700],
    ('Sales', 'In-Store'): [1500, 1600, 1700, 1800, 1900, 2000, 2100, 2200],
    ('Expenses', 'Online'): [300, 400, 350, 450, 500, 550, 600, 650],
    ('Expenses', 'In-Store'): [700, 750, 800, 850, 900, 950, 1000, 1050]
}
financial_data = pd.DataFrame(data, index=index)
financial_data

              Sales          Expenses
             Online In-Store   Online In-Store
Year Quarter
2021 Q1        1000     1500      300      700
     Q2        1200     1600      400      750
     Q3        1100     1700      350      800
     Q4        1300     1800      450      850
2022 Q1        1400     1900      500      900
     Q2        1500     2000      550      950
     Q3        1600     2100      600     1000
     Q4        1700     2200      650     1050

In [39]:
#a. What are the online sales for Q1 2022? 
online_sales_2022 = financial_data.loc[(2022, 'Q1'), ('Sales', 'Online')]
online_sales_2022

1400

In [41]:
#b. How much were the in-store expenses in Q3 2021? 
instore_expenses_2021 = financial_data.loc[(2021, 'Q3'), ('Expenses', 'In-Store')]
instore_expenses_2021

800

In [43]:
#c. What are the total sales for Q4 2021? 
total_sales_2021 = financial_data.loc[(2021, 'Q4'), ('Sales', 'Online')] + financial_data.loc[(2021, 'Q4'), ('Sales', 'In-Store')]
total_sales_2021

3100

In [45]:
#d.What were the expenses for the online channel in 2022?
online_expenses_2022 = financial_data.loc[2022, ('Expenses', 'Online')]
online_expenses_2022

Quarter
Q1    500
Q2    550
Q3    600
Q4    650
Name: (Expenses, Online), dtype: int64

In [47]:
#e. Retrieve sales data for Q2 2021. 
sales_2021 = financial_data.loc[(2021, 'Q2'), 'Sales']
sales_2021

Online      1200
In-Store    1600
Name: (2021, Q2), dtype: int64

In [49]:
#f.What is the maximum expense recorded in 2022?
max_expense_2022 = financial_data.loc[2022, 'Expenses'].max().max()
max_expense_2022

1050

In [57]:
#2. Stack a DataFrame of Store, Product, and Sales. 
# Sample data for stacking
store_data = pd.DataFrame({
    'Store': ['A', 'B', 'A', 'B'],
    'Product': ['P1', 'P1', 'P2', 'P2'],
    'Sales': [100, 200, 150, 250]
})
store_data

Store  Product
A      P1       Sales    100
B      P1       Sales    200
A      P2       Sales    150
B      P2       Sales    250
dtype: int64

In [55]:
# Stack the DataFrame
stacked_store_data = store_data.set_index(['Store', 'Product']).stack()
stacked_store_data

Store  Product
A      P1       Sales    100
B      P1       Sales    200
A      P2       Sales    150
B      P2       Sales    250
dtype: int64

In [61]:
#3. Unstack it to show sales by store.
unstacked_sales_by_store = stacked_store_data.unstack(level='Store')
unstacked_sales_by_store

Store            A    B
Product
P1      Sales  100  200
P2      Sales  150  250

In [65]:
#4. Create a multi-index with Department and Role. 
employee_data = pd.DataFrame({
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Role': ['Manager', 'Assistant', 'Manager', 'Assistant', 'Manager', 'Assistant'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank']
})

# Set multi-index
employee_data = employee_data.set_index(['Department', 'Role'])
employee_data

                     Employee
Department Role
Sales      Manager      Alice
           Assistant      Bob
HR         Manager    Charlie
           Assistant    David
IT         Manager        Eve
           Assistant    Frank

In [67]:
#5.Access employees from a specific department. 
hr_employees = employee_data.loc['HR']
hr_employees

          Employee
Role
Manager    Charlie
Assistant    David

In [71]:
#6.  Sort a DataFrame of student grades by Subject and Grade
grades_data = pd.DataFrame({
    'Student': ['John', 'Alice', 'Bob', 'Daisy'],
    'Subject': ['Math', 'Science', 'Math', 'Science'],
    'Grade': [85, 90, 78, 88]
})

# Sort by Subject and then by Grade
sorted_grades = grades_data.sort_values(by=['Subject', 'Grade'])
sorted_grades

  Student  Subject  Grade
2     Bob     Math     78
0    John     Math     85
3   Daisy  Science     88
1   Alice  Science     90

In [73]:
#7. Reset the index of the sorted grades.
reset_sorted_grades = sorted_grades.reset_index(drop=True)
reset_sorted_grades

  Student  Subject  Grade
0     Bob     Math     78
1    John     Math     85
2   Daisy  Science     88
3   Alice  Science     90

In [75]:
#8.  Set the Date column as the index in a weather DataFrame 
weather_data = pd.DataFrame({
    'Date': pd.to_datetime(['2024-01-01', '2024-01-02', '2024-01-03']),
    'Temperature': [32, 35, 30],
    'Humidity': [80, 85, 90]
})

# Set Date as the index
weather_data.set_index('Date', inplace=True)
weather_data

            Temperature  Humidity
Date
2024-01-01           32        80
2024-01-02           35        85
2024-01-03           30        90

In [77]:
#9. Flatten a multi-index DataFrame of product sales.
product_sales = pd.DataFrame({
    ('Category', 'Product'): [('Electronics', 'Laptop'), ('Electronics', 'Phone'), ('Clothing', 'Shirt')],
    'Sales': [1500, 1000, 500]
})
product_sales.columns = pd.MultiIndex.from_tuples([('Category', 'Type'), ('Metrics', 'Sales')])

# Flatten the multi-index columns
product_sales.columns = ['_'.join(col).strip() for col in product_sales.columns.values]
product_sales

           Category_Type  Metrics_Sales
0  (Electronics, Laptop)           1500
1   (Electronics, Phone)           1000
2      (Clothing, Shirt)            500

In [79]:
#10. Create a multi-index using Category and Product in a product DataFrame. Then, average the levels in the column.
# Sample data
product_data = pd.DataFrame({
    'Category': ['Electronics', 'Electronics', 'Clothing', 'Clothing'],
    'Product': ['Laptop', 'Phone', 'Shirt', 'Pants'],
    'Price': [1500, 1000, 500, 400]
})

# Set multi-index
product_data.set_index(['Category', 'Product'], inplace=True)

# Average by category
avg_price_by_category = product_data.groupby(level='Category').mean()
avg_price_by_category

              Price
Category
Clothing      450.0
Electronics  1250.0